Zmiana digramu PlantUML na Mermaid
